app/views/users/show.html.erb

SELECT "todos".* FROM "todos" WHERE "todos"."user_id" = $1  [["user_id", 1]]
---
                                    <!-- Renders each todo action item -->
                                        <% todo.todo_actions.each do |todo_action| %>