app/controllers/todos_controller.rb

INSERT INTO "todos" ("name", "description", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "jkj"], ["description", "kj"], ["user_id", 1], ["created_at", "2016-02-10 07:16:02.952225"], ["updated_at", "2016-02-10 07:16:02.952225"]]
---
  def create
     new_todo = Todo.new(todo_params)
     new_todo.user = current_user
     if new_todo.save