app/controllers/todo_actions_controller.rb

INSERT INTO "todo_actions" ("name", "todo_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "mm,m,"], ["todo_id", 1], ["created_at", "2016-02-10 07:16:11.930974"], ["updated_at", "2016-02-10 07:16:11.930974"]]
---
   def create
    @todo_action = TodoAction.create(action_params)