app/controllers/users_controller.rb

  def show
    @user = current_user
    @todo = Todo.new
    @todo_action = TodoAction.new
    @todos = @user.todos.all
---
SELECT "todos".* FROM "todos" WHERE "todos"."user_id" = $1  [["user_id", 1]]